Revit 2026 API

# StiffenerClassification Enumeration

---

This enumeration is used to classify the stiffener.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StiffenerClassification
```
```vb
Public Enumeration StiffenerClassification
```
```cpp
public enum class StiffenerClassification
```
```fsharp
type StiffenerClassification
```

| Member name | Value | Description |
| --- | --- | --- |
| External | 0 |  |
| Internal | 1 |  |

#### Reference

Autodesk.Revit.DB Namespace